---
type: SpatialElementCalculationPoint
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# SpatialElementCalculationPoint

`Autodesk.Revit.DB.SpatialElementCalculationPoint` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Parameter | — | `` |
| Property | Position | 2013 | `public XYZ Position { get ; set ; }` |